ПомощникHR/src/Documents/Вакансии/Вакансии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Вакансии</name>
  <attributes>
    <name>Работодатель</name>
    <type>
      <types>CatalogRef.Работодатели</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкладОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкладДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОпытОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОпытДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Архивная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаВакансию</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОклада</name>
    <type>
      <types>EnumRef.ТипыОкладов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеХарактеристик</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеФункцОбязанностей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Характеристики</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиДолжностей</types>
      </type>
    </attributes>
    <attributes>
      <name>Требуется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФункциональныеОбязанности</name>
    <attributes>
      <name>ФункциональнаяОбязанность</name>
      <type>
        <types>CatalogRef.ФункциональныеОбязанности</types>
      </type>
    </attributes>
    <attributes>
      <name>Требуется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ПомощникHR/src/Catalogs/Должности/Должности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Должности</name>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АльтернативныеНаименования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Характеристики</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиДолжностей</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КлючевыеНавыки</name>
    <attributes>
      <name>Навык</name>
      <type>
        <types>CatalogRef.КлючевыеНавыкиДолжности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ПомощникHR/src/Documents/Вакансии/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ЗаполнитьХарактеристикиДолжности()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Должность);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДолжностиХарактеристики.Характеристика КАК Характеристика,
	|	ЛОЖЬ КАК Требуется
	|ИЗ
	|	Справочник.Должности.Характеристики КАК ДолжностиХарактеристики
	|ГДЕ
	|	ДолжностиХарактеристики.Ссылка = &Ссылка";
	
	Объект.Характеристики.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФункциональныеОбязанностиДолжности()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", Объект.Должность);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФункциональныеОбязанности.Ссылка КАК ФункциональнаяОбязанность,
	|	ЛОЖЬ КАК Требуется
	|ИЗ
	|	Справочник.ФункциональныеОбязанности КАК ФункциональныеОбязанности
	|ГДЕ
	|	ФункциональныеОбязанности.Владелец = &Владелец";
	
	Объект.ФункциональныеОбязанности.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ДолжностьПриИзмененииНаСервере()
	
	Объект.Характеристики.Очистить();
	Объект.ФункциональныеОбязанности.Очистить();
	
	Если ЗначениеЗаполнено(Объект.Должность) Тогда
		ЗаполнитьХарактеристикиДолжности();
		ЗаполнитьФункциональныеОбязанностиДолжности();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДолжностьПриИзменении(Элемент)
	ДолжностьПриИзмененииНаСервере();
КонецПроцедуры
